{
  "text": "### Terms & Conditions\n\nàTerms and Conditions\r\n\nThese are the terms and conditions that govern all bookings made through our booking services, whether through our websites and mobile websites.\r\n\nAll references to \"We\", \"Us\" or \"Our\" in these terms refer to Beddertravel.com. Your use of the Beddertravel Sites and any bookings you make via the Beddertravel Sites are subject to these terms and conditions (the \"Terms\").\r\n\nYou agree to use the Beddertravel Sites in accordance with and subject to these Terms. If you do not accept these Terms, please do not use the Beddertravel Sites and do not make a booking via the Beddertravel Sites.\r\n\n1. Bookings\r\n\n1.1 We facilitate the processing and booking of accommodation and other travel services (the “travel services”) on behalf of travel services providers. Our role is to facilitate you finding and choosing travel services and we do not act on your behalf. We do not provide, own or run any travel services ourselves and in particular we do not provide, own or run any accommodation.\r\n\n1.2 You confirm that you are of sufficient age to use the Beddertravel Sites lawfully, enter into a contract and to create binding legal obligations for any liability you may incur as a result of the use of the Beddertravel Sites. You understand that you are financially responsible for all uses of the Beddertravel Sites by you and those using your log-in information.\r\n\n1.3 When you make a booking using the Beddertravel Sites, you agree to enter into a contract for travel services and your contract for travel services (including accommodation) is with the travel services provider, not Beddertravel, as we are only acting as a communication party between the travel services provider and you. It is the travel services provider's responsibility to provide you with the travel services. We are not responsible for the fulfilment of any booking made through the Beddertravel Sites or for the quality of any accommodation or any other travel services that are booked.\r\n\n1.4 Please note that all bookings are subject to the booking conditions displayed to you prior to you confirming your booking (the “Booking Conditions”).\r\n\n2. Making and Cancelling a Booking\r\n\n2.1 On making a booking, you will be required to pay a deposit (being a part payment towards the total value of your booking) which we collect for and on behalf of the travel services provider and which will always be non-refundable unless;\r\n\n(a) the  travel service provider has not been verified and does not actually exists\r\n\nYou may also be required to pay a flat booking fee for use of the Beddertravel Sites when a booking is made with a travel services provider. Where we charge a booking fee, it is non-refundable in all circumstances. We do not act as your agent and the booking fee is payable for use of the Beddertravel Sites.\r\n\nSave as set out in the Booking Conditions, or the travel service provider’s terms and conditions, you will be responsible to the travel services provider on arrival for payment of the balance of the cost of the booking made by you, together with any other payments for any additional services subsequently agreed with the travel services provider and, where applicable, payment of the travel services provider's service charges and taxes, pursuant to the terms and conditions of trade applied by such travel services provider.\r\n\n2.2 You must use a credit card or debit card to guarantee a booking. By making a booking with your credit card or debit card, you agree to accept the relevant cancellation and no-show policy of the travel services provider as set out in its terms and conditions. In the event that you cancel your booking outside the permitted timeframe specified in the travel service provider’s terms and conditions, you authorise the travel services provider to charge to your credit card or debit card without further reference to you an amount not exceeding the charge for one night's stay (in the case of accommodation) or such other amount as may be set out in the travel service provider's terms and conditions. Please note that there will be no additional charges for cancellations or no-shows in respect of Non-Refundable Bookings, but you will not be refunded the cost of any part of your booking in such circumstances.\r\n\n2.3 Your non-arrival by the agreed check-in time may result in the cancellation of your entire booking. Any amendments to your booking must be notified to and agreed with the travel services provider directly (but no refund of all or any part of the deposit will be made). Please note it is not possible to amend Non-Refundable Bookings. In making a booking, it shall be your responsibility to disclose to the travel services provider any requirements or special facilities that you or a member of your party may need as a result of any medical conditions.\r\n\n2.4 When a booking is confirmed we will issue the booking confirmation on behalf of the travel services provider for each booking, but will not provide information about any charges for additional services. We will endeavour to ensure that the booking confirmation includes details of all taxes charged by the travel services provider, in relation to which please see clause 8.9 below. We strongly recommend you check and confirm with the travel services provider the precise terms and conditions upon which the travel services provider makes the reserved service available to you upon receipt of the booking confirmation. The reference numbers included on the booking confirmation should be quoted in all enquiries, cancellation or modification of the booking.\r\n\n2.5 You may cancel your booking in accordance with the cancellation policy of the provider as disclosed on the booking confirmation and detailed property description page; this is normally at least 24 hours before your agreed check-in date.\r\n\n2.7 If you cancel your booking, regardless of how much notice you give, deposits and booking fees will be non-refundable. Non-Flexible Booking customers should note that, even though your deposit and booking fee will be non-refundable in any event, you must give the amount of notice stipulated by the travel services provider in its cancellation policy, in order to avoid being charged an additional payment for a \"no show\" (see clause 2.2 above).\r\n\n3. Liability and Disclaimers\r\n\n3.1 In the event of a problem arising with your accommodation or other travel services, you should contact the travel services provider. If you have a problem with the booking that you have made via the Beddertravel Sites please contact us directly via info@beddertravel.com.\r\n\n3.2 We are acting solely as a communicating agent between you and the travel service provider (and not as your agent) when processing bookings. As such, we are not a party to the contract between you and the travel services provider for the provision of travel services (including accommodation) and we have no responsibility or liability to you in respect of the terms of that contract. For example, we are not responsible for:\r\n\n(a) the accuracy or completeness of the descriptions of accommodation and other travel services (including rates, availability and ratings) that are displayed on the Beddertravel Sites, or the quality or fitness for purpose of the accommodation and other travel services that are or may be booked through the Beddertravel Sites;\r\n\n(b) the fulfilment of a booking made through the Beddertravel Sites, including any acts or omissions of travel services providers, any cancellation of a booking by a travel services provider for any reason whatsoever or any failure to provide all or any part of the booked service by that provider; or\r\n\n(c) any error or failure in the making or recording of a booking which is due to any circumstances that are outside our control (such as a power failure).\r\n\n3.3 Neither we nor any of our directors, employees, affiliates or other representatives will be liable to you (or any member of your corporate group, your affiliates or any other person or party who has an interest in the booking) for: (i) indirect, punitive, special or consequential loss or damages, (ii) loss of data, income, profits, business, opportunity, reputation, goodwill or (iii) loss of or damage to property, in each case arising out of or in connection with the use of any information, products, services, facilities and/or the materials offered through the Beddertravel Sites, even if we have been advised of the possibility of such loss or damage, or such loss or damages were reasonably foreseeable.\r\n\n3.4 Our maximum aggregate liability to you (and any other party that has an interest in the booking) in relation to any booking made through us (whether in contract, tort or otherwise) shall be limited solely to the value of the booking fee that has been paid for that booking. Prior to making a booking, you should ensure that you have reviewed the travel services provider's terms and conditions and that they are acceptable to you.\r\n\n3.5 We have not visited all the accommodation listed on the Beddertravel Sites and we do not carry out routine checks of the accommodation. The listing of any travel services (including accommodation) on the Beddertravel Sites is not and should not be taken as a specific recommendation from us or a representation that the travel services will be suitable for your purpose or that the travel services will be of any particular quality.\r\n\n3.6 Save as otherwise set out in these Terms, and to the greatest extent permitted by applicable law, all representations, warranties and conditions, including those implied by statute or otherwise, are hereby excluded, including without limitation representations, warranties or undertakings about any of the services, facilities, information and/or materials on the Beddertravel Sites, including without limitation, their accuracy, their completeness or their merchantability, quality or fitness for a particular purpose. The Beddertravel Sites are provided strictly on an \"as is\" basis and, in particular, we do not warrant that the information published on the Beddertravel Sites will be error-free or that the Beddertravel Sites will be virus or bug-free.\r\n\n3.7 Nothing in these Terms shall operate to exclude or limit liability arising out of: (i) fraud or fraudulent misrepresentation, or (ii) death or personal injury.\r\n\n4. Credit and Debit Card Security\r\n\n4.0 . Every transaction are processed through Stripe, a leader in secure online transaction. Beddertravel.com does not save any of your information related to your credit card. No employee, explorator or travel service provider will have access to your credit card information\r\n\n4.1 . HOWEVER, if unauthorised charges appear on your credit card or debit card statement for any card used on the Beddertravel Sites at any time during or after you make your booking, conduct your transaction or disclose your card details on the Beddertravel Sites, Beddertravel shall not be liable or responsible in any way in respect of any damage or loss of whatsoever nature suffered by you arising from or in any way connected with said use, transaction or disclosure, save where such unauthorised charges appear as a direct result of our negligence and subject to any statutory rights which you may have.\r\n\n5. Intellectual Property Rights and Web-links\r\n\n5.1 The information, content, software, graphics, text, sounds, images, buttons, trademarks, service marks, trade names and logos (\"Materials\") contained in the Beddertravel Sites are protected by copyright, trade marks, database rights, and any other intellectual property rights. The parties hereby agree that we or our licensors (as the case may be) retain all right, title, interest and intellectual property rights in and to the Materials. We grant you a limited, revocable, non-transferable, non-sublicenseable, license to use the Beddertravel Sites for your personal non-commercial purposes to access the Beddertravel Sites and make bookings in accordance with these Terms (the \"Limited Licence\"). Save in respect of exercising your Limited Licence, you may not modify, copy, distribute, transmit, display, perform, reproduce, publish, license, create derivative works from, transfer, or sell any Materials. Other than the Limited Licence, nothing in these Terms shall be construed as transferring or granting (by implication or otherwise) to you any licence or right in or to the Materials.\r\n\n5.2 The Beddertravel Sites may contain hyperlinks to websites operated by parties other than us. Such hyperlinks are provided for your reference only. We do not control such websites and are not responsible for their contents. The inclusion of hyperlinks on the Beddertravel Sites to such other websites does not imply any endorsement of the material on such websites or any association with their operators.\r\n\n5.3 The Beddertravel Sites are made available for personal use. You may not copy, monitor, screen-scrape, spider, deep-link or reproduce any content, information or software displayed on the Beddertravel Sites for any commercial or competitive purpose.\r\n\n6. User Generated Content\r\n\n6.1 Certain parts of the Beddertravel Sites may allow you or third parties to post content, reviews, messages, photos, materials or other items (these being \"User Generated Content Features\"). You are solely responsible for your use of such User Generated Content Features and use them at your own risk. By using any User Generated Content Features, you expressly agree not to post, upload to, transmit, distribute, store, create or otherwise publish through the Beddertravel Sites any of the following:\r\n\n(a) Any message, data, information, text, music, sound, photos, graphics, code or other material (\"Content\") that is unlawful, libelous, defamatory, obscene, pornographic, indecent, lewd, offensive, harassing, threatening, abusive, inflammatory, fraudulent, invasive of privacy or publicity rights or otherwise objectionable or inappropriate;\r\n\n(b) Content that may infringe any patent, trademark, trade secret, copyright or other intellectual or proprietary right of any party;\r\n\n(c) Content that impersonates any person or entity or otherwise misrepresents your affiliation with a person or entity;\r\n\n(d) Content that may infringe a third party's privacy or data protection rights;\r\n\n(e) Viruses, corrupted data or other harmful, disruptive or destructive files; or\r\n\n(f) Content that, in our sole judgment, is objectionable or which restricts or inhibits any other person from using or enjoying the Beddertravel Sites, or which may expose us or our users to any harm or liability of any type.\r\n\n6.2 We accept no responsibility and are not liable for any Content of any kind that is posted, stored or uploaded by you or any third party on the Beddertravel Sites, or for any loss or damage caused as a result thereof. As a provider of interactive services, we are not liable for any statements, representations or Content provided by users of the User Generated Content Features or other public forum. Although we have no obligation to screen, edit or monitor any of the Content posted to or distributed through the User Generated Content Features, we reserve the right, and have absolute discretion, to remove, screen or edit without notice any Content posted or stored on the Beddertravel Sites at any time and for any reason, and you are solely responsible for creating backup copies of and replacing any Content you post or store on the Beddertravel Sites at your sole cost and expense.\r\n\n6.3 Any use of the User Generated Content Features or other portions of the Beddertravel Sites otherwise than in accordance with these Terms may result in, among other things, termination or suspension of your access to the User Generated Content Features and/or the Beddertravel Sites. In order to comply with an order of a court of competent jurisdiction or to protect our systems or users of the Beddertravel Sites, we may process and disclose any information held by us in relation to a user of the Beddertravel Sites who posts or uploads inappropriate or objectionable Content including, without limitation, their name, email address, IP address, usage history, and posted Content.\r\n\n6.4 By posting or distributing Content to or through the Beddertravel Sites, unless we indicate otherwise, you:\r\n\n(a) grant us a nonexclusive, royalty-free, perpetual, transferable, irrevocable and fully sub-licensable right to use, reproduce, modify, adapt, translate, distribute, publish, create derivative works from and publicly display and perform such Content throughout the world in any media whatsoever;\r\n\n(b) represent and warrant that the Content that you post or otherwise distribute (i) complies with these Terms; (ii) is accurate and not misleading; and (iii) shall not expose us to any civil or criminal liability or otherwise materially adversely affect our business or reputation.\r\n\n7. Reviews\r\n\n7.1 You may be asked to review the travel services that you have received. We appreciate all feedback, but please note that the travel services provider in question will have access to your review so that they can act on your feedback and make any necessary improvements. The travel services providers will have your contact details and may contact you to ask further questions about your experiences in order to help them to make further improvements.\r\n\n8. General\r\n\n8.1 These Terms are drafted in the English language. If these Terms are translated into any other language, the English language version shall prevail\r\n\n8.2 Our failure to enforce at any time or for any period any one or more of the Terms shall not be construed as a waiver of them or the rights attaching to any of them.\r\n\n8.3 The Terms constitute the entire agreement between you and Beddertravel in relation to the subject matter of these Terms and supersedes any previous agreements or representations between the parties relating to the subject matter of this agreement.\r\n\n8.4 We reserve the right to change these Terms as well as the contents of the Beddertravel Sites for any reason and without liability to you, any other user or any third party. This right shall not affect the Terms accepted by you upon making a legitimate booking or purchase using the Beddertravel Sites. You should check these Terms for any changes each time you access the Beddertravel Sites.\r\n\n8.5 These Terms and your use of the Beddertravel Sites are governed by the laws of Ireland. You hereby consent to the exclusive jurisdiction of the Irish courts in all disputes arising out of or relating to the use of the Beddertravel Sites each time you access the Beddertravel Sites. Use of the Beddertravel Sites is not authorised in any jurisdiction that does not give effect to all provisions of these Terms including, without limitation, this clause.\r\n\n8.6 Our performance of these Terms is subject to existing laws and legal process and nothing contained in this agreement is in derogation of our right to comply with law enforcement requests or requirements relating to your use of the Beddertravel Sites or information provided to or gathered by us with respect to such use.\r\n\n8.7 If any part of these Terms is determined to be invalid or unenforceable, then the invalid or unenforceable provision shall be deemed to be superseded by any such valid, enforceable provision that most closely matches the intent of the original provision and the remainder of these Terms shall continue in effect.\r\n\n8.8 Although we cannot monitor the conduct of our users offsite, it shall be a breach of these Terms to use any information obtained from the Beddertravel Sites in order to harass, abuse or harm other persons, or in order to contact, advertise to, solicit or sell to any user or person without their prior express consent.\r\n\n8.9 While our terms require that travel services providers display prices which are inclusive of all value added and other additional taxes, the price displayed is ultimately the responsibility of the travel services provider rather than ours. You acknowledge that we shall not have liability to you in respect of any attempt by travel services provider to levy additional value added or other taxes on you at the point of payment as a supplement to the price displayed and your sole recourse in this regard will be against the travel services provider.\r\n\n \r\n\n \r\n\n9. Terms specific for Hosts\r\n\n9.1 Terms applicable to all Listings\r\n\n9.1.1 When creating a Listing through the Beddertravel Platform you must (i) provide complete and accurate information about your Host Service (such as listing description, location, and calendar availability), (ii) disclose any deficiencies, restrictions (such as house rules) and requirements that apply (such as any minimum age, proficiency or fitness requirements for an Experience) and (iii) provide any other pertinent information requested by Beddertravel. You are responsible for keeping your Listing information (including calendar availability) up-to-date at all times.\r\n\n9.1.2 You are solely responsible for setting a price (including any Taxes if applicable, or charges such as cleaning fees) for your Listing (“Listing Fee”). Once a Guest requests a booking of your Listing, you may not request that the Guest pays a higher price than in the booking request.\r\n\n9.1.3 Any terms and conditions included in your Listing, in particular in relation to cancellations, must not conflict with these Terms or the relevant cancellation policy for your Listing.\r\n\n9.1.5 Pictures, animations or videos (collectively, \"Images\") used in your Listings must accurately reflect the quality and condition of your Host Services. Beddertravel reserves the right to require that Listings have a minimum number of Images of a certain format, size and resolution.\r\n\n9.1.6 The placement and ranking of Listings in search results on the Beddertravel Platform may vary and depend on a variety of factors, such as Guest search parameters and preferences, Host requirements, price and calendar availability, number and quality of Images, customer service and cancellation history, Reviews and Ratings, type of Host Service, and/or ease of booking. \r\n\n9.1.7 When you accept or have pre-approved a booking request by a Guest, you are entering into a legally binding agreement with the Guest and are required to provide your Host Service(s) to the Guest as described in your Listing when the booking request is made.\r\n\n9.1.8 Beddertravel recommends that Hosts obtain appropriate insurance for their Host Services. Please review any respective insurance policy carefully, and in particular make sure that you are familiar with and understand any exclusions to, and any deductibles that may apply for, such insurance policy, including, but not limited to, whether or not your insurance policy will cover the actions or inactions of Guests (and the individuals the Guest has booked for, if applicable) while staying at your Accommodation or participating in your Experience, Event or other Host Service.\r\n\n10 Terms for explorers\r\n\nTo be written soon"
}